----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
              ReLU-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]           9,216
       BatchNorm2d-5         [-1, 32, 112, 112]              64
              ReLU-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 64, 112, 112]          18,432
       BatchNorm2d-8         [-1, 64, 112, 112]             128
              ReLU-9         [-1, 64, 112, 112]               0
        MaxPool2d-10           [-1, 64, 56, 56]               0
      BatchNorm2d-11           [-1, 64, 56, 56]             128
             ReLU-12           [-1, 64, 56, 56]               0
             ReLU-13           [-1, 64, 56, 56]               0
           Conv2d-14           [-1, 32, 56, 56]           2,048
      BatchNorm2d-15           [-1, 32, 56, 56]              64
             ReLU-16           [-1, 32, 56, 56]               0
             ReLU-17           [-1, 32, 56, 56]               0
           Conv2d-18           [-1, 32, 56, 56]           9,216
      BatchNorm2d-19           [-1, 32, 56, 56]              64
             ReLU-20           [-1, 32, 56, 56]               0
             ReLU-21           [-1, 32, 56, 56]               0
           Conv2d-22          [-1, 128, 56, 56]           4,096
      BatchNorm2d-23           [-1, 64, 56, 56]             128
             ReLU-24           [-1, 64, 56, 56]               0
             ReLU-25           [-1, 64, 56, 56]               0
           Conv2d-26          [-1, 128, 56, 56]           8,192
       Bottleneck-27          [-1, 128, 56, 56]               0
      BatchNorm2d-28          [-1, 128, 56, 56]             256
             ReLU-29          [-1, 128, 56, 56]               0
           Conv2d-30           [-1, 32, 56, 56]           4,096
      BatchNorm2d-31           [-1, 32, 56, 56]              64
             ReLU-32           [-1, 32, 56, 56]               0
           Conv2d-33           [-1, 32, 56, 56]           9,216
      BatchNorm2d-34           [-1, 32, 56, 56]              64
             ReLU-35           [-1, 32, 56, 56]               0
           Conv2d-36          [-1, 128, 56, 56]           4,096
       Bottleneck-37          [-1, 128, 56, 56]               0
        MaxPool2d-38          [-1, 128, 28, 28]               0
        MaxPool2d-39          [-1, 128, 28, 28]               0
        MaxPool2d-40          [-1, 128, 28, 28]               0
        MaxPool2d-41          [-1, 128, 28, 28]               0
        MaxPool2d-42          [-1, 128, 28, 28]               0
        MaxPool2d-43          [-1, 128, 28, 28]               0
        MaxPool2d-44          [-1, 128, 28, 28]               0
      BatchNorm2d-45          [-1, 128, 28, 28]             256
             ReLU-46          [-1, 128, 28, 28]               0
             ReLU-47          [-1, 128, 28, 28]               0
           Conv2d-48           [-1, 64, 28, 28]           8,192
      BatchNorm2d-49           [-1, 64, 28, 28]             128
             ReLU-50           [-1, 64, 28, 28]               0
             ReLU-51           [-1, 64, 28, 28]               0
           Conv2d-52           [-1, 64, 28, 28]          36,864
      BatchNorm2d-53           [-1, 64, 28, 28]             128
             ReLU-54           [-1, 64, 28, 28]               0
             ReLU-55           [-1, 64, 28, 28]               0
           Conv2d-56          [-1, 256, 28, 28]          16,384
      BatchNorm2d-57          [-1, 128, 28, 28]             256
             ReLU-58          [-1, 128, 28, 28]               0
             ReLU-59          [-1, 128, 28, 28]               0
           Conv2d-60          [-1, 256, 28, 28]          32,768
       Bottleneck-61          [-1, 256, 28, 28]               0
      BatchNorm2d-62          [-1, 256, 28, 28]             512
             ReLU-63          [-1, 256, 28, 28]               0
           Conv2d-64           [-1, 64, 28, 28]          16,384
      BatchNorm2d-65           [-1, 64, 28, 28]             128
             ReLU-66           [-1, 64, 28, 28]               0
           Conv2d-67           [-1, 64, 28, 28]          36,864
      BatchNorm2d-68           [-1, 64, 28, 28]             128
             ReLU-69           [-1, 64, 28, 28]               0
           Conv2d-70          [-1, 256, 28, 28]          16,384
       Bottleneck-71          [-1, 256, 28, 28]               0
      BatchNorm2d-72          [-1, 256, 28, 28]             512
             ReLU-73          [-1, 256, 28, 28]               0
           Conv2d-74           [-1, 64, 28, 28]          16,384
      BatchNorm2d-75           [-1, 64, 28, 28]             128
             ReLU-76           [-1, 64, 28, 28]               0
           Conv2d-77           [-1, 64, 28, 28]          36,864
      BatchNorm2d-78           [-1, 64, 28, 28]             128
             ReLU-79           [-1, 64, 28, 28]               0
           Conv2d-80          [-1, 256, 28, 28]          16,384
       Bottleneck-81          [-1, 256, 28, 28]               0
      BatchNorm2d-82          [-1, 256, 28, 28]             512
             ReLU-83          [-1, 256, 28, 28]               0
           Conv2d-84           [-1, 64, 28, 28]          16,384
      BatchNorm2d-85           [-1, 64, 28, 28]             128
             ReLU-86           [-1, 64, 28, 28]               0
           Conv2d-87           [-1, 64, 28, 28]          36,864
      BatchNorm2d-88           [-1, 64, 28, 28]             128
             ReLU-89           [-1, 64, 28, 28]               0
           Conv2d-90          [-1, 256, 28, 28]          16,384
       Bottleneck-91          [-1, 256, 28, 28]               0
        MaxPool2d-92          [-1, 256, 14, 14]               0
        MaxPool2d-93          [-1, 256, 14, 14]               0
        MaxPool2d-94          [-1, 256, 14, 14]               0
        MaxPool2d-95          [-1, 256, 14, 14]               0
        MaxPool2d-96          [-1, 256, 14, 14]               0
        MaxPool2d-97          [-1, 256, 14, 14]               0
        MaxPool2d-98          [-1, 256, 14, 14]               0
      BatchNorm2d-99          [-1, 256, 14, 14]             512
            ReLU-100          [-1, 256, 14, 14]               0
            ReLU-101          [-1, 256, 14, 14]               0
          Conv2d-102          [-1, 128, 14, 14]          32,768
     BatchNorm2d-103          [-1, 128, 14, 14]             256
            ReLU-104          [-1, 128, 14, 14]               0
            ReLU-105          [-1, 128, 14, 14]               0
          Conv2d-106          [-1, 128, 14, 14]         147,456
     BatchNorm2d-107          [-1, 128, 14, 14]             256
            ReLU-108          [-1, 128, 14, 14]               0
            ReLU-109          [-1, 128, 14, 14]               0
          Conv2d-110          [-1, 512, 14, 14]          65,536
     BatchNorm2d-111          [-1, 256, 14, 14]             512
            ReLU-112          [-1, 256, 14, 14]               0
            ReLU-113          [-1, 256, 14, 14]               0
          Conv2d-114          [-1, 512, 14, 14]         131,072
      Bottleneck-115          [-1, 512, 14, 14]               0
     BatchNorm2d-116          [-1, 512, 14, 14]           1,024
            ReLU-117          [-1, 512, 14, 14]               0
          Conv2d-118          [-1, 128, 14, 14]          65,536
     BatchNorm2d-119          [-1, 128, 14, 14]             256
            ReLU-120          [-1, 128, 14, 14]               0
          Conv2d-121          [-1, 128, 14, 14]         147,456
     BatchNorm2d-122          [-1, 128, 14, 14]             256
            ReLU-123          [-1, 128, 14, 14]               0
          Conv2d-124          [-1, 512, 14, 14]          65,536
      Bottleneck-125          [-1, 512, 14, 14]               0
     BatchNorm2d-126          [-1, 512, 14, 14]           1,024
            ReLU-127          [-1, 512, 14, 14]               0
          Conv2d-128          [-1, 128, 14, 14]          65,536
     BatchNorm2d-129          [-1, 128, 14, 14]             256
            ReLU-130          [-1, 128, 14, 14]               0
          Conv2d-131          [-1, 128, 14, 14]         147,456
     BatchNorm2d-132          [-1, 128, 14, 14]             256
            ReLU-133          [-1, 128, 14, 14]               0
          Conv2d-134          [-1, 512, 14, 14]          65,536
      Bottleneck-135          [-1, 512, 14, 14]               0
     BatchNorm2d-136          [-1, 512, 14, 14]           1,024
            ReLU-137          [-1, 512, 14, 14]               0
          Conv2d-138          [-1, 128, 14, 14]          65,536
     BatchNorm2d-139          [-1, 128, 14, 14]             256
            ReLU-140          [-1, 128, 14, 14]               0
          Conv2d-141          [-1, 128, 14, 14]         147,456
     BatchNorm2d-142          [-1, 128, 14, 14]             256
            ReLU-143          [-1, 128, 14, 14]               0
          Conv2d-144          [-1, 512, 14, 14]          65,536
      Bottleneck-145          [-1, 512, 14, 14]               0
     BatchNorm2d-146          [-1, 512, 14, 14]           1,024
            ReLU-147          [-1, 512, 14, 14]               0
          Conv2d-148          [-1, 128, 14, 14]          65,536
     BatchNorm2d-149          [-1, 128, 14, 14]             256
            ReLU-150          [-1, 128, 14, 14]               0
          Conv2d-151          [-1, 128, 14, 14]         147,456
     BatchNorm2d-152          [-1, 128, 14, 14]             256
            ReLU-153          [-1, 128, 14, 14]               0
          Conv2d-154          [-1, 512, 14, 14]          65,536
      Bottleneck-155          [-1, 512, 14, 14]               0
     BatchNorm2d-156          [-1, 512, 14, 14]           1,024
            ReLU-157          [-1, 512, 14, 14]               0
          Conv2d-158          [-1, 128, 14, 14]          65,536
     BatchNorm2d-159          [-1, 128, 14, 14]             256
            ReLU-160          [-1, 128, 14, 14]               0
          Conv2d-161          [-1, 128, 14, 14]         147,456
     BatchNorm2d-162          [-1, 128, 14, 14]             256
            ReLU-163          [-1, 128, 14, 14]               0
          Conv2d-164          [-1, 512, 14, 14]          65,536
      Bottleneck-165          [-1, 512, 14, 14]               0
     BatchNorm2d-166          [-1, 512, 14, 14]           1,024
            ReLU-167          [-1, 512, 14, 14]               0
          Conv2d-168          [-1, 128, 14, 14]          65,536
     BatchNorm2d-169          [-1, 128, 14, 14]             256
            ReLU-170          [-1, 128, 14, 14]               0
          Conv2d-171          [-1, 128, 14, 14]         147,456
     BatchNorm2d-172          [-1, 128, 14, 14]             256
            ReLU-173          [-1, 128, 14, 14]               0
          Conv2d-174          [-1, 512, 14, 14]          65,536
      Bottleneck-175          [-1, 512, 14, 14]               0
     BatchNorm2d-176          [-1, 512, 14, 14]           1,024
            ReLU-177          [-1, 512, 14, 14]               0
          Conv2d-178          [-1, 128, 14, 14]          65,536
     BatchNorm2d-179          [-1, 128, 14, 14]             256
            ReLU-180          [-1, 128, 14, 14]               0
          Conv2d-181          [-1, 128, 14, 14]         147,456
     BatchNorm2d-182          [-1, 128, 14, 14]             256
            ReLU-183          [-1, 128, 14, 14]               0
          Conv2d-184          [-1, 512, 14, 14]          65,536
      Bottleneck-185          [-1, 512, 14, 14]               0
       MaxPool2d-186            [-1, 512, 7, 7]               0
       MaxPool2d-187            [-1, 512, 7, 7]               0
       MaxPool2d-188            [-1, 512, 7, 7]               0
       MaxPool2d-189            [-1, 512, 7, 7]               0
       MaxPool2d-190            [-1, 512, 7, 7]               0
       MaxPool2d-191            [-1, 512, 7, 7]               0
       MaxPool2d-192            [-1, 512, 7, 7]               0
     BatchNorm2d-193            [-1, 512, 7, 7]           1,024
            ReLU-194            [-1, 512, 7, 7]               0
          Conv2d-195            [-1, 256, 7, 7]         131,072
     BatchNorm2d-196            [-1, 256, 7, 7]             512
            ReLU-197            [-1, 256, 7, 7]               0
          Conv2d-198           [-1, 1024, 7, 7]         263,168
     BatchNorm2d-199           [-1, 1024, 7, 7]           2,048
            ReLU-200           [-1, 1024, 7, 7]               0
AdaptiveAvgPool2d-201           [-1, 1024, 1, 1]               0
          Conv2d-202             [-1, 32, 1, 1]          32,800
            ReLU-203             [-1, 32, 1, 1]               0
          Conv2d-204            [-1, 512, 1, 1]          16,896
         Sigmoid-205            [-1, 512, 1, 1]               0
     BatchNorm2d-206           [-1, 1024, 7, 7]           2,048
            ReLU-207           [-1, 1024, 7, 7]               0
            ReLU-208           [-1, 1024, 7, 7]               0
          Conv2d-209            [-1, 128, 7, 7]         131,072
     BatchNorm2d-210            [-1, 128, 7, 7]             256
            ReLU-211            [-1, 128, 7, 7]               0
            ReLU-212            [-1, 128, 7, 7]               0
          Conv2d-213            [-1, 128, 7, 7]         147,456
     BatchNorm2d-214            [-1, 128, 7, 7]             256
            ReLU-215            [-1, 128, 7, 7]               0
            ReLU-216            [-1, 128, 7, 7]               0
          Conv2d-217            [-1, 512, 7, 7]          65,536
     BatchNorm2d-218           [-1, 1024, 7, 7]           2,048
            ReLU-219           [-1, 1024, 7, 7]               0
            ReLU-220           [-1, 1024, 7, 7]               0
          Conv2d-221            [-1, 512, 7, 7]         524,288
      Bottleneck-222            [-1, 512, 7, 7]               0
     BatchNorm2d-223            [-1, 512, 7, 7]           1,024
            ReLU-224            [-1, 512, 7, 7]               0
          Conv2d-225            [-1, 128, 7, 7]          65,536
     BatchNorm2d-226            [-1, 128, 7, 7]             256
            ReLU-227            [-1, 128, 7, 7]               0
          Conv2d-228            [-1, 128, 7, 7]         147,456
     BatchNorm2d-229            [-1, 128, 7, 7]             256
            ReLU-230            [-1, 128, 7, 7]               0
          Conv2d-231            [-1, 512, 7, 7]          65,536
      Bottleneck-232            [-1, 512, 7, 7]               0
     BatchNorm2d-233            [-1, 512, 7, 7]           1,024
            ReLU-234            [-1, 512, 7, 7]               0
          Conv2d-235            [-1, 128, 7, 7]          65,536
     BatchNorm2d-236            [-1, 128, 7, 7]             256
            ReLU-237            [-1, 128, 7, 7]               0
          Conv2d-238            [-1, 128, 7, 7]         147,456
     BatchNorm2d-239            [-1, 128, 7, 7]             256
            ReLU-240            [-1, 128, 7, 7]               0
          Conv2d-241            [-1, 512, 7, 7]          65,536
      Bottleneck-242            [-1, 512, 7, 7]               0
     BatchNorm2d-243            [-1, 512, 7, 7]           1,024
            ReLU-244            [-1, 512, 7, 7]               0
          Conv2d-245            [-1, 128, 7, 7]          65,536
     BatchNorm2d-246            [-1, 128, 7, 7]             256
            ReLU-247            [-1, 128, 7, 7]               0
          Conv2d-248            [-1, 128, 7, 7]         147,456
     BatchNorm2d-249            [-1, 128, 7, 7]             256
            ReLU-250            [-1, 128, 7, 7]               0
          Conv2d-251            [-1, 512, 7, 7]          65,536
      Bottleneck-252            [-1, 512, 7, 7]               0
     BatchNorm2d-253            [-1, 512, 7, 7]           1,024
            ReLU-254            [-1, 512, 7, 7]               0
          Conv2d-255            [-1, 128, 7, 7]          65,536
     BatchNorm2d-256            [-1, 128, 7, 7]             256
            ReLU-257            [-1, 128, 7, 7]               0
          Conv2d-258            [-1, 128, 7, 7]         147,456
     BatchNorm2d-259            [-1, 128, 7, 7]             256
            ReLU-260            [-1, 128, 7, 7]               0
          Conv2d-261            [-1, 512, 7, 7]          65,536
      Bottleneck-262            [-1, 512, 7, 7]               0
     BatchNorm2d-263            [-1, 512, 7, 7]           1,024
            ReLU-264            [-1, 512, 7, 7]               0
          Conv2d-265            [-1, 128, 7, 7]          65,536
     BatchNorm2d-266            [-1, 128, 7, 7]             256
            ReLU-267            [-1, 128, 7, 7]               0
          Conv2d-268            [-1, 128, 7, 7]         147,456
     BatchNorm2d-269            [-1, 128, 7, 7]             256
            ReLU-270            [-1, 128, 7, 7]               0
          Conv2d-271            [-1, 512, 7, 7]          65,536
      Bottleneck-272            [-1, 512, 7, 7]               0
        Upsample-273          [-1, 512, 14, 14]               0
        Upsample-274          [-1, 512, 14, 14]               0
        Upsample-275          [-1, 512, 14, 14]               0
        Upsample-276          [-1, 512, 14, 14]               0
     BatchNorm2d-277          [-1, 256, 14, 14]             512
            ReLU-278          [-1, 256, 14, 14]               0
          Conv2d-279           [-1, 64, 14, 14]          16,384
     BatchNorm2d-280           [-1, 64, 14, 14]             128
            ReLU-281           [-1, 64, 14, 14]               0
          Conv2d-282           [-1, 64, 14, 14]          36,864
     BatchNorm2d-283           [-1, 64, 14, 14]             128
            ReLU-284           [-1, 64, 14, 14]               0
          Conv2d-285          [-1, 256, 14, 14]          16,384
      Bottleneck-286          [-1, 256, 14, 14]               0
     BatchNorm2d-287          [-1, 256, 14, 14]             512
            ReLU-288          [-1, 256, 14, 14]               0
          Conv2d-289           [-1, 64, 14, 14]          16,384
     BatchNorm2d-290           [-1, 64, 14, 14]             128
            ReLU-291           [-1, 64, 14, 14]               0
          Conv2d-292           [-1, 64, 14, 14]          36,864
     BatchNorm2d-293           [-1, 64, 14, 14]             128
            ReLU-294           [-1, 64, 14, 14]               0
          Conv2d-295          [-1, 256, 14, 14]          16,384
      Bottleneck-296          [-1, 256, 14, 14]               0
     BatchNorm2d-297          [-1, 768, 14, 14]           1,536
            ReLU-298          [-1, 768, 14, 14]               0
          Conv2d-299           [-1, 96, 14, 14]          73,728
     BatchNorm2d-300           [-1, 96, 14, 14]             192
            ReLU-301           [-1, 96, 14, 14]               0
          Conv2d-302           [-1, 96, 14, 14]          82,944
     BatchNorm2d-303           [-1, 96, 14, 14]             192
            ReLU-304           [-1, 96, 14, 14]               0
          Conv2d-305          [-1, 384, 14, 14]          36,864
      Bottleneck-306          [-1, 384, 14, 14]               0
     BatchNorm2d-307          [-1, 384, 14, 14]             768
            ReLU-308          [-1, 384, 14, 14]               0
          Conv2d-309           [-1, 96, 14, 14]          36,864
     BatchNorm2d-310           [-1, 96, 14, 14]             192
            ReLU-311           [-1, 96, 14, 14]               0
          Conv2d-312           [-1, 96, 14, 14]          82,944
     BatchNorm2d-313           [-1, 96, 14, 14]             192
            ReLU-314           [-1, 96, 14, 14]               0
          Conv2d-315          [-1, 384, 14, 14]          36,864
      Bottleneck-316          [-1, 384, 14, 14]               0
        Upsample-317          [-1, 384, 28, 28]               0
        Upsample-318          [-1, 384, 28, 28]               0
        Upsample-319          [-1, 384, 28, 28]               0
        Upsample-320          [-1, 384, 28, 28]               0
     BatchNorm2d-321          [-1, 128, 28, 28]             256
            ReLU-322          [-1, 128, 28, 28]               0
          Conv2d-323           [-1, 32, 28, 28]           4,096
     BatchNorm2d-324           [-1, 32, 28, 28]              64
            ReLU-325           [-1, 32, 28, 28]               0
          Conv2d-326           [-1, 32, 28, 28]           9,216
     BatchNorm2d-327           [-1, 32, 28, 28]              64
            ReLU-328           [-1, 32, 28, 28]               0
          Conv2d-329          [-1, 128, 28, 28]           4,096
      Bottleneck-330          [-1, 128, 28, 28]               0
     BatchNorm2d-331          [-1, 128, 28, 28]             256
            ReLU-332          [-1, 128, 28, 28]               0
          Conv2d-333           [-1, 32, 28, 28]           4,096
     BatchNorm2d-334           [-1, 32, 28, 28]              64
            ReLU-335           [-1, 32, 28, 28]               0
          Conv2d-336           [-1, 32, 28, 28]           9,216
     BatchNorm2d-337           [-1, 32, 28, 28]              64
            ReLU-338           [-1, 32, 28, 28]               0
          Conv2d-339          [-1, 128, 28, 28]           4,096
      Bottleneck-340          [-1, 128, 28, 28]               0
     BatchNorm2d-341          [-1, 512, 28, 28]           1,024
            ReLU-342          [-1, 512, 28, 28]               0
          Conv2d-343           [-1, 64, 28, 28]          32,768
     BatchNorm2d-344           [-1, 64, 28, 28]             128
            ReLU-345           [-1, 64, 28, 28]               0
          Conv2d-346           [-1, 64, 28, 28]          36,864
     BatchNorm2d-347           [-1, 64, 28, 28]             128
            ReLU-348           [-1, 64, 28, 28]               0
          Conv2d-349          [-1, 256, 28, 28]          16,384
      Bottleneck-350          [-1, 256, 28, 28]               0
     BatchNorm2d-351          [-1, 256, 28, 28]             512
            ReLU-352          [-1, 256, 28, 28]               0
          Conv2d-353           [-1, 64, 28, 28]          16,384
     BatchNorm2d-354           [-1, 64, 28, 28]             128
            ReLU-355           [-1, 64, 28, 28]               0
          Conv2d-356           [-1, 64, 28, 28]          36,864
     BatchNorm2d-357           [-1, 64, 28, 28]             128
            ReLU-358           [-1, 64, 28, 28]               0
          Conv2d-359          [-1, 256, 28, 28]          16,384
      Bottleneck-360          [-1, 256, 28, 28]               0
        Upsample-361          [-1, 256, 56, 56]               0
        Upsample-362          [-1, 256, 56, 56]               0
        Upsample-363          [-1, 256, 56, 56]               0
        Upsample-364          [-1, 256, 56, 56]               0
     BatchNorm2d-365           [-1, 64, 56, 56]             128
            ReLU-366           [-1, 64, 56, 56]               0
          Conv2d-367           [-1, 16, 56, 56]           1,024
     BatchNorm2d-368           [-1, 16, 56, 56]              32
            ReLU-369           [-1, 16, 56, 56]               0
          Conv2d-370           [-1, 16, 56, 56]           2,304
     BatchNorm2d-371           [-1, 16, 56, 56]              32
            ReLU-372           [-1, 16, 56, 56]               0
          Conv2d-373           [-1, 64, 56, 56]           1,024
      Bottleneck-374           [-1, 64, 56, 56]               0
     BatchNorm2d-375           [-1, 64, 56, 56]             128
            ReLU-376           [-1, 64, 56, 56]               0
          Conv2d-377           [-1, 16, 56, 56]           1,024
     BatchNorm2d-378           [-1, 16, 56, 56]              32
            ReLU-379           [-1, 16, 56, 56]               0
          Conv2d-380           [-1, 16, 56, 56]           2,304
     BatchNorm2d-381           [-1, 16, 56, 56]              32
            ReLU-382           [-1, 16, 56, 56]               0
          Conv2d-383           [-1, 64, 56, 56]           1,024
      Bottleneck-384           [-1, 64, 56, 56]               0
     BatchNorm2d-385          [-1, 320, 56, 56]             640
            ReLU-386          [-1, 320, 56, 56]               0
          Conv2d-387           [-1, 80, 56, 56]          25,600
     BatchNorm2d-388           [-1, 80, 56, 56]             160
            ReLU-389           [-1, 80, 56, 56]               0
          Conv2d-390           [-1, 80, 56, 56]          57,600
     BatchNorm2d-391           [-1, 80, 56, 56]             160
            ReLU-392           [-1, 80, 56, 56]               0
          Conv2d-393          [-1, 320, 56, 56]          25,600
      Bottleneck-394          [-1, 320, 56, 56]               0
     BatchNorm2d-395          [-1, 320, 56, 56]             640
            ReLU-396          [-1, 320, 56, 56]               0
          Conv2d-397           [-1, 80, 56, 56]          25,600
     BatchNorm2d-398           [-1, 80, 56, 56]             160
            ReLU-399           [-1, 80, 56, 56]               0
          Conv2d-400           [-1, 80, 56, 56]          57,600
     BatchNorm2d-401           [-1, 80, 56, 56]             160
            ReLU-402           [-1, 80, 56, 56]               0
          Conv2d-403          [-1, 320, 56, 56]          25,600
      Bottleneck-404          [-1, 320, 56, 56]               0
       MaxPool2d-405          [-1, 320, 28, 28]               0
       MaxPool2d-406          [-1, 320, 28, 28]               0
       MaxPool2d-407          [-1, 320, 28, 28]               0
       MaxPool2d-408          [-1, 320, 28, 28]               0
       MaxPool2d-409          [-1, 320, 28, 28]               0
       MaxPool2d-410          [-1, 320, 28, 28]               0
       MaxPool2d-411          [-1, 320, 28, 28]               0
     BatchNorm2d-412          [-1, 512, 28, 28]           1,024
            ReLU-413          [-1, 512, 28, 28]               0
          Conv2d-414          [-1, 128, 28, 28]          65,536
     BatchNorm2d-415          [-1, 128, 28, 28]             256
            ReLU-416          [-1, 128, 28, 28]               0
          Conv2d-417          [-1, 128, 28, 28]         147,456
     BatchNorm2d-418          [-1, 128, 28, 28]             256
            ReLU-419          [-1, 128, 28, 28]               0
          Conv2d-420          [-1, 512, 28, 28]          65,536
      Bottleneck-421          [-1, 512, 28, 28]               0
     BatchNorm2d-422          [-1, 512, 28, 28]           1,024
            ReLU-423          [-1, 512, 28, 28]               0
          Conv2d-424          [-1, 128, 28, 28]          65,536
     BatchNorm2d-425          [-1, 128, 28, 28]             256
            ReLU-426          [-1, 128, 28, 28]               0
          Conv2d-427          [-1, 128, 28, 28]         147,456
     BatchNorm2d-428          [-1, 128, 28, 28]             256
            ReLU-429          [-1, 128, 28, 28]               0
          Conv2d-430          [-1, 512, 28, 28]          65,536
      Bottleneck-431          [-1, 512, 28, 28]               0
     BatchNorm2d-432          [-1, 832, 28, 28]           1,664
            ReLU-433          [-1, 832, 28, 28]               0
          Conv2d-434          [-1, 208, 28, 28]         173,056
     BatchNorm2d-435          [-1, 208, 28, 28]             416
            ReLU-436          [-1, 208, 28, 28]               0
          Conv2d-437          [-1, 208, 28, 28]         389,376
     BatchNorm2d-438          [-1, 208, 28, 28]             416
            ReLU-439          [-1, 208, 28, 28]               0
          Conv2d-440          [-1, 832, 28, 28]         173,056
      Bottleneck-441          [-1, 832, 28, 28]               0
     BatchNorm2d-442          [-1, 832, 28, 28]           1,664
            ReLU-443          [-1, 832, 28, 28]               0
          Conv2d-444          [-1, 208, 28, 28]         173,056
     BatchNorm2d-445          [-1, 208, 28, 28]             416
            ReLU-446          [-1, 208, 28, 28]               0
          Conv2d-447          [-1, 208, 28, 28]         389,376
     BatchNorm2d-448          [-1, 208, 28, 28]             416
            ReLU-449          [-1, 208, 28, 28]               0
          Conv2d-450          [-1, 832, 28, 28]         173,056
      Bottleneck-451          [-1, 832, 28, 28]               0
       MaxPool2d-452          [-1, 832, 14, 14]               0
       MaxPool2d-453          [-1, 832, 14, 14]               0
       MaxPool2d-454          [-1, 832, 14, 14]               0
       MaxPool2d-455          [-1, 832, 14, 14]               0
       MaxPool2d-456          [-1, 832, 14, 14]               0
       MaxPool2d-457          [-1, 832, 14, 14]               0
       MaxPool2d-458          [-1, 832, 14, 14]               0
     BatchNorm2d-459          [-1, 768, 14, 14]           1,536
            ReLU-460          [-1, 768, 14, 14]               0
          Conv2d-461          [-1, 192, 14, 14]         147,456
     BatchNorm2d-462          [-1, 192, 14, 14]             384
            ReLU-463          [-1, 192, 14, 14]               0
          Conv2d-464          [-1, 192, 14, 14]         331,776
     BatchNorm2d-465          [-1, 192, 14, 14]             384
            ReLU-466          [-1, 192, 14, 14]               0
          Conv2d-467          [-1, 768, 14, 14]         147,456
      Bottleneck-468          [-1, 768, 14, 14]               0
     BatchNorm2d-469          [-1, 768, 14, 14]           1,536
            ReLU-470          [-1, 768, 14, 14]               0
          Conv2d-471          [-1, 192, 14, 14]         147,456
     BatchNorm2d-472          [-1, 192, 14, 14]             384
            ReLU-473          [-1, 192, 14, 14]               0
          Conv2d-474          [-1, 192, 14, 14]         331,776
     BatchNorm2d-475          [-1, 192, 14, 14]             384
            ReLU-476          [-1, 192, 14, 14]               0
          Conv2d-477          [-1, 768, 14, 14]         147,456
      Bottleneck-478          [-1, 768, 14, 14]               0
     BatchNorm2d-479         [-1, 1600, 14, 14]           3,200
            ReLU-480         [-1, 1600, 14, 14]               0
          Conv2d-481          [-1, 400, 14, 14]         640,000
     BatchNorm2d-482          [-1, 400, 14, 14]             800
            ReLU-483          [-1, 400, 14, 14]               0
          Conv2d-484          [-1, 400, 14, 14]       1,440,000
     BatchNorm2d-485          [-1, 400, 14, 14]             800
            ReLU-486          [-1, 400, 14, 14]               0
          Conv2d-487         [-1, 1600, 14, 14]         640,000
      Bottleneck-488         [-1, 1600, 14, 14]               0
     BatchNorm2d-489         [-1, 1600, 14, 14]           3,200
            ReLU-490         [-1, 1600, 14, 14]               0
          Conv2d-491          [-1, 400, 14, 14]         640,000
     BatchNorm2d-492          [-1, 400, 14, 14]             800
            ReLU-493          [-1, 400, 14, 14]               0
          Conv2d-494          [-1, 400, 14, 14]       1,440,000
     BatchNorm2d-495          [-1, 400, 14, 14]             800
            ReLU-496          [-1, 400, 14, 14]               0
          Conv2d-497         [-1, 1600, 14, 14]         640,000
      Bottleneck-498         [-1, 1600, 14, 14]               0
     BatchNorm2d-499         [-1, 1600, 14, 14]           3,200
            ReLU-500         [-1, 1600, 14, 14]               0
          Conv2d-501          [-1, 400, 14, 14]         640,000
     BatchNorm2d-502          [-1, 400, 14, 14]             800
            ReLU-503          [-1, 400, 14, 14]               0
          Conv2d-504          [-1, 400, 14, 14]       1,440,000
     BatchNorm2d-505          [-1, 400, 14, 14]             800
            ReLU-506          [-1, 400, 14, 14]               0
          Conv2d-507         [-1, 1600, 14, 14]         640,000
      Bottleneck-508         [-1, 1600, 14, 14]               0
     BatchNorm2d-509         [-1, 1600, 14, 14]           3,200
            ReLU-510         [-1, 1600, 14, 14]               0
          Conv2d-511          [-1, 400, 14, 14]         640,000
     BatchNorm2d-512          [-1, 400, 14, 14]             800
            ReLU-513          [-1, 400, 14, 14]               0
          Conv2d-514          [-1, 400, 14, 14]       1,440,000
     BatchNorm2d-515          [-1, 400, 14, 14]             800
            ReLU-516          [-1, 400, 14, 14]               0
          Conv2d-517         [-1, 1600, 14, 14]         640,000
      Bottleneck-518         [-1, 1600, 14, 14]               0
       MaxPool2d-519           [-1, 1600, 7, 7]               0
       MaxPool2d-520           [-1, 1600, 7, 7]               0
       MaxPool2d-521           [-1, 1600, 7, 7]               0
       MaxPool2d-522           [-1, 1600, 7, 7]               0
       MaxPool2d-523           [-1, 1600, 7, 7]               0
       MaxPool2d-524           [-1, 1600, 7, 7]               0
       MaxPool2d-525           [-1, 1600, 7, 7]               0
     BatchNorm2d-526            [-1, 512, 7, 7]           1,024
            ReLU-527            [-1, 512, 7, 7]               0
          Conv2d-528            [-1, 128, 7, 7]          65,536
     BatchNorm2d-529            [-1, 128, 7, 7]             256
            ReLU-530            [-1, 128, 7, 7]               0
          Conv2d-531            [-1, 128, 7, 7]         147,456
     BatchNorm2d-532            [-1, 128, 7, 7]             256
            ReLU-533            [-1, 128, 7, 7]               0
          Conv2d-534            [-1, 512, 7, 7]          65,536
      Bottleneck-535            [-1, 512, 7, 7]               0
     BatchNorm2d-536            [-1, 512, 7, 7]           1,024
            ReLU-537            [-1, 512, 7, 7]               0
          Conv2d-538            [-1, 128, 7, 7]          65,536
     BatchNorm2d-539            [-1, 128, 7, 7]             256
            ReLU-540            [-1, 128, 7, 7]               0
          Conv2d-541            [-1, 128, 7, 7]         147,456
     BatchNorm2d-542            [-1, 128, 7, 7]             256
            ReLU-543            [-1, 128, 7, 7]               0
          Conv2d-544            [-1, 512, 7, 7]          65,536
      Bottleneck-545            [-1, 512, 7, 7]               0
     BatchNorm2d-546            [-1, 512, 7, 7]           1,024
            ReLU-547            [-1, 512, 7, 7]               0
          Conv2d-548            [-1, 128, 7, 7]          65,536
     BatchNorm2d-549            [-1, 128, 7, 7]             256
            ReLU-550            [-1, 128, 7, 7]               0
          Conv2d-551            [-1, 128, 7, 7]         147,456
     BatchNorm2d-552            [-1, 128, 7, 7]             256
            ReLU-553            [-1, 128, 7, 7]               0
          Conv2d-554            [-1, 512, 7, 7]          65,536
      Bottleneck-555            [-1, 512, 7, 7]               0
     BatchNorm2d-556            [-1, 512, 7, 7]           1,024
            ReLU-557            [-1, 512, 7, 7]               0
          Conv2d-558            [-1, 128, 7, 7]          65,536
     BatchNorm2d-559            [-1, 128, 7, 7]             256
            ReLU-560            [-1, 128, 7, 7]               0
          Conv2d-561            [-1, 128, 7, 7]         147,456
     BatchNorm2d-562            [-1, 128, 7, 7]             256
            ReLU-563            [-1, 128, 7, 7]               0
          Conv2d-564            [-1, 512, 7, 7]          65,536
      Bottleneck-565            [-1, 512, 7, 7]               0
     BatchNorm2d-566           [-1, 2112, 7, 7]           4,224
            ReLU-567           [-1, 2112, 7, 7]               0
          Conv2d-568           [-1, 1056, 7, 7]       2,230,272
     BatchNorm2d-569           [-1, 1056, 7, 7]           2,112
            ReLU-570           [-1, 1056, 7, 7]               0
AdaptiveAvgPool2d-571           [-1, 1056, 1, 1]               0
         Flatten-572                 [-1, 1056]               0
          Linear-573                   [-1, 42]          44,394
       Unflatten-574              [-1, 6, 7, 1]               0
         Softmax-575              [-1, 6, 7, 1]               0
            Fish-576              [-1, 6, 7, 1]               0
================================================================
Total params: 23,946,794
Trainable params: 23,946,794
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 537.27
Params size (MB): 91.35
Estimated Total Size (MB): 629.20
----------------------------------------------------------------
